// See comment at end for file info
#ifndef _CTGAIMAGE
#define _CTGAIMAGE

#include "standard.h"

class CTgaHeader
{
public:

	BYTE idLength;        // 00h  Size of Image ID field 

	BYTE colorMapType;    // 01h  Color map type 

	BYTE imageType;       // 02h  Image type code 

	WORD cMapStart;       // 03h  Color map origin 
	WORD cMapLength;      // 05h  Color map length 
	BYTE cMapDepth;       // 07h  Depth of color map entries 

	WORD xOffset;         // 08h  X origin of image 
	WORD yOffset;         // 0Ah  Y origin of image 

	WORD width;           // 0Ch  Width of image 
	WORD height;          // 0Eh  Height of image 

	BYTE pixelDepth;      // 10h  Image pixel size 

	// bit 0-3 contain the number of attribute bits per pixel; bits are found only for 16 and 32 bit
	// bit 4 left or right
	// bit 5 top or bottom
	// bit 6-7 are unused
	BYTE imageDescriptor;

	CTgaHeader()
	{
		memset(this, 0x00, sizeof(CTgaHeader));
	}
};

class CTgaFooter
{
public:

	DWORD extensionOffset;	// Extension Area Offset 
	DWORD developerOffset;	// Developer Directory Offset 

	CHAR signature[18];		// TGA Signature 

	CTgaFooter()
	{
		memset(this, 0x00, sizeof(CTgaFooter));
	}

	VOID ReadValues(FILE* f)
	{
		fread_s(&extensionOffset, sizeof(DWORD), sizeof(DWORD), 1, f);
		fread_s(&developerOffset, sizeof(DWORD), sizeof(DWORD), 1, f);
		fread_s(&signature, sizeof(CHAR) * 18, sizeof(CHAR), 18, f);
	}
};

class CTgaTag
{
public:

	WORD tagNumber;	// ID Number of the tag 

	DWORD offset;	// Offset location of the tag data 

	DWORD size;		// Size of the tag data in bytes 

	CTgaTag()
	{
		memset(this, 0x00, sizeof(CTgaTag));
